sandboxes/depth/deprecated/crigeos/sandbox/hvh/proxy/java/schemas/Comprehensive.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
	<env:Header>
		<gch:requestID xmlns:gch="http://www.geocat.ch/2003/05/gateway/header"
			env:mustUnderstand="true">
			<gch:version>0.99</gch:version>
			<gch:sendingNodeId>sendingNode</gch:sendingNodeId>
			<gch:referenceId>3</gch:referenceId>
			<gch:messageId>uuid:2df72abd-8995-48b0-99f9-f4aa2b50d4db
			</gch:messageId>
			<gch:responseTo>3</gch:responseTo>
			<gch:dateAndTime>2008-02-20T10:47:03.000+01:00</gch:dateAndTime>
		</gch:requestID>
	</env:Header>
	<env:Body>
		<gcq:catalogGatewayRequest
			xmlns:gcq="http://www.geocat.ch/2003/05/gateway/query">
			<gcq:queryResult>
				<gcq:GM03Count>314</gcq:GM03Count>
			</gcq:queryResult>
		</gcq:catalogGatewayRequest>
	</env:Body>
</env:Envelope>
